lukejin-dev/upiot-nrf52833/apps/ble_app_hrs_nfc_pairing/src/classa.c
    //SpiInit( &SX126x.Spi, SPI_2, SX126X_MOSI, SX126X_MISO, SX126X_SCLK, SX126X_NSS );
    //SX126xIoInit(SX126X_BUSY, SX126X_DIO1, SX126X_RESET, NC);

    macPrimitives.MacMcpsConfirm = McpsConfirm;
    macPrimitives.MacMcpsIndication = McpsIndication;
    macPrimitives.MacMlmeConfirm = MlmeConfirm;
    macPrimitives.MacMlmeIndication = MlmeIndication;
    macCallbacks.GetBatteryLevel = BoardGetBatteryLevel;
    macCallbacks.GetTemperatureLevel = NULL;
    macCallbacks.NvmContextChange = NvmCtxMgmtEvent;
    macCallbacks.MacProcessNotify = OnMacProcessNotify;

    status = LoRaMacInitialization( &macPrimitives, &macCallbacks, ACTIVE_REGION );
    if ( status != LORAMAC_STATUS_OK )
    {
        NRF_LOG_INFO( "LoRaMac wasn't properly initialized, error: %s", MacStatusStrings[status] );
        // Fatal error, endless loop.
        while ( 1 )
        {
        }
    }

    DeviceState = DEVICE_STATE_RESTORE;

    NRF_LOG_INFO( "###### ===== ClassA demo application v1.0.0 ==== ######\n\n" );
}

static uint8_t devEui[8] = { 0 };  // Automatically filed from secure-element
static uint8_t joinEui[8] = { 0 }; // Automatically filed from secure-element
static uint8_t sePin[4] = { 0 };   // Automatically filed from secure-element
static MibRequestConfirm_t mibReq;
static LoRaMacStatus_t status;

void up_lorawan_loop( void )
{
    // Process Radio IRQ
    if( Radio.IrqProcess != NULL )
    {
        Radio.IrqProcess( );
    }
    // Processes the LoRaMac events
    LoRaMacProcess( );

    switch( DeviceState )
    {
        case DEVICE_STATE_RESTORE:
        {
            // Try to restore from NVM and query the mac if possible.
            if( NvmCtxMgmtRestore( ) == NVMCTXMGMT_STATUS_SUCCESS )
            {
                NRF_LOG_INFO( "\n###### ===== CTXS RESTORED ==== ######\n\n" );
            }
            else
            {
                // Read secure-element DEV_EUI, JOI_EUI and SE_PIN values.
                mibReq.Type = MIB_DEV_EUI;
                LoRaMacMibGetRequestConfirm( &mibReq );
                memcpy1( devEui, mibReq.Param.DevEui, 8 );

                mibReq.Type = MIB_JOIN_EUI;
                LoRaMacMibGetRequestConfirm( &mibReq );
                memcpy1( joinEui, mibReq.Param.JoinEui, 8 );

                mibReq.Type = MIB_SE_PIN;
                LoRaMacMibGetRequestConfirm( &mibReq );
                memcpy1( sePin, mibReq.Param.SePin, 4 );

#if( OVER_THE_AIR_ACTIVATION == 0 )
                // Tell the MAC layer which network server version are we connecting too.
                mibReq.Type = MIB_ABP_LORAWAN_VERSION;
                mibReq.Param.AbpLrWanVersion.Value = ABP_ACTIVATION_LRWAN_VERSION;
                LoRaMacMibSetRequestConfirm( &mibReq );

                mibReq.Type = MIB_NET_ID;
                mibReq.Param.NetID = LORAWAN_NETWORK_ID;
                LoRaMacMibSetRequestConfirm( &mibReq );

                // Choose a random device address if not already defined in Commissioning.h
#if( STATIC_DEVICE_ADDRESS != 1 )
                // Random seed initialization
                //srand1( BoardGetRandomSeed( ) );
                srand1(0);
                // Choose a random device address
                DevAddr = randr( 0, 0x01FFFFFF );
#endif

                mibReq.Type = MIB_DEV_ADDR;
                mibReq.Param.DevAddr = DevAddr;
                LoRaMacMibSetRequestConfirm( &mibReq );
#endif // #if( OVER_THE_AIR_ACTIVATION == 0 )
            }
            DeviceState = DEVICE_STATE_START;
            break;
        }

        case DEVICE_STATE_START:
        {
            TimerInit( &TxNextPacketTimer, OnTxNextPacketTimerEvent );

            //TimerInit( &Led1Timer, OnLed1TimerEvent );
            //TimerSetValue( &Led1Timer, 25 );

            //TimerInit( &Led3Timer, OnLed3TimerEvent );
            //TimerSetValue( &Led3Timer, 25 );

            mibReq.Type = MIB_PUBLIC_NETWORK;
            mibReq.Param.EnablePublicNetwork = LORAWAN_PUBLIC_NETWORK;
            LoRaMacMibSetRequestConfirm( &mibReq );

            mibReq.Type = MIB_ADR;
            mibReq.Param.AdrEnable = LORAWAN_ADR_ON;
            LoRaMacMibSetRequestConfirm( &mibReq );

#if defined( REGION_EU868 ) || defined( REGION_RU864 ) || defined( REGION_CN779 ) || defined( REGION_EU433 )
            LoRaMacTestSetDutyCycleOn( LORAWAN_DUTYCYCLE_ON );
#endif
            mibReq.Type = MIB_SYSTEM_MAX_RX_ERROR;
            mibReq.Param.SystemMaxRxError = 20;
            LoRaMacMibSetRequestConfirm( &mibReq );

            LoRaMacStart( );

            mibReq.Type = MIB_NETWORK_ACTIVATION;
            status = LoRaMacMibGetRequestConfirm( &mibReq );

            if( status == LORAMAC_STATUS_OK )
            {
                if( mibReq.Param.NetworkActivation == ACTIVATION_TYPE_NONE )
                {
                    DeviceState = DEVICE_STATE_JOIN;
                }
                else
                {
                    DeviceState = DEVICE_STATE_SEND;
                    NextTx = true;
                }
            }
            break;
        }
        case DEVICE_STATE_JOIN:
        {
            //mibReq.Type = MIB_DEV_EUI;
            //LoRaMacMibGetRequestConfirm( &mibReq );
            /**
            NRF_LOG_INFO( "DevEui      : %02X", mibReq.Param.DevEui[0] );
            for( int i = 1; i < 8; i++ )
            {
                NRF_LOG_INFO( "-%02X", mibReq.Param.DevEui[i] );
            }
            NRF_LOG_INFO( "\n" );
            **/
            //NRF_LOG_HEXDUMP_INFO(mibReq.Param.DevEui, 8);

            //mibReq.Type = MIB_JOIN_EUI;
            //LoRaMacMibGetRequestConfirm( &mibReq );
            /**
            NRF_LOG_INFO( "JoinEui     : %02X", mibReq.Param.JoinEui[0] );
            for( int i = 1; i < 8; i++ )
            {
                NRF_LOG_INFO( "-%02X", mibReq.Param.JoinEui[i] );
            }
            NRF_LOG_INFO( "\n" );
            **/
            //NRF_LOG_HEXDUMP_INFO(mibReq.Param.JoinEui, 8);

            //mibReq.Type = MIB_SE_PIN;
            //LoRaMacMibGetRequestConfirm( &mibReq );
            /**
            NRF_LOG_INFO( "Pin         : %02X", mibReq.Param.SePin[0] );
            for( int i = 1; i < 4; i++ )
            {
                NRF_LOG_INFO( "-%02X", mibReq.Param.SePin[i] );
            }
            NRF_LOG_INFO( "\n\n" );
            **/
            //NRF_LOG_HEXDUMP_INFO(mibReq.Param.SePin, 4);

#if( OVER_THE_AIR_ACTIVATION == 0 )
            NRF_LOG_INFO( "###### ===== JOINED ==== ######\n" );
            NRF_LOG_INFO( "\nABP\n\n" );
            NRF_LOG_INFO( "DevAddr     : %08lX\n", DevAddr );
            NRF_LOG_INFO( "\n\n" );

            mibReq.Type = MIB_NETWORK_ACTIVATION;
            mibReq.Param.NetworkActivation = ACTIVATION_TYPE_ABP;
            LoRaMacMibSetRequestConfirm( &mibReq );

