lukejin-dev/upiot-nrf52833/apps/ble_app_hrs_nfc_pairing/src/classa.c
            DeviceState = DEVICE_STATE_SEND;
#else
            JoinNetwork( );
#endif
            break;
        }
        case DEVICE_STATE_SEND:
        {
            if( NextTx == true )
            {
                PrepareTxFrame( AppPort );

                NextTx = SendFrame( );
            }
            DeviceState = DEVICE_STATE_CYCLE;
            break;
        }
        case DEVICE_STATE_CYCLE:
        {
            DeviceState = DEVICE_STATE_SLEEP;
            if( ComplianceTest.Running == true )
            {
                // Schedule next packet transmission
                TxDutyCycleTime = 5000; // 5000 ms
            }
            else
            {
                // Schedule next packet transmission
                TxDutyCycleTime = APP_TX_DUTYCYCLE + randr( -APP_TX_DUTYCYCLE_RND, APP_TX_DUTYCYCLE_RND );
            }

            // Schedule next packet transmission
            TimerSetValue( &TxNextPacketTimer, TxDutyCycleTime );
            TimerStart( &TxNextPacketTimer );
            break;
        }
        case DEVICE_STATE_SLEEP:
        {
            if( NvmCtxMgmtStore( ) == NVMCTXMGMT_STATUS_SUCCESS )
            {
                NRF_LOG_INFO( "\n###### ===== CTXS STORED ==== ######\n" );
            }

            CRITICAL_SECTION_BEGIN( );
            if( IsMacProcessPending == 1 )
            {
                // Clear flag and prevent MCU to go into low power modes.
                IsMacProcessPending = 0;
            }
            else
            {
                // The MCU wakes up through events
                //BoardLowPowerHandler( );
            }
            CRITICAL_SECTION_END( );
            break;
        }
        default:
        {
            DeviceState = DEVICE_STATE_START;
            break;
        }
    }
}
